tabularnew_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    INLET
    {
        type            patch;
        nFaces          32;
        startFace       22056;
    }
    OUTLET
    {
        type            patch;
        nFaces          32;
        startFace       22088;
    }
    WALL
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4016;
        startFace       22120;
    }
)

// ************************************************************************* //
