tabularnew_case/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    note        "mesh decomposition control dictionary";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  2;

method          simple;

simpleCoeffs
{
    n           (1 2 1);
    delta       0.001;
}

hierarchicalCoeffs
{
    n           (1 1 1);
    delta       0.001;
    order       xyz;
}

manualCoeffs
{
    dataFile    "decompositionData";
}

distributed     no;

roots	();

// ************************************************************************* //
